/**********************STM32 开源无人机*******************************************************/
//  V1.0 开源作者：小南&zin；日期：2016.11.21
//           STM32F103C8飞控以及遥控基础功能以及核心代码实现；
//  V2.0 开源作者：小刘；日期：2020.05.17
//           scheduler任务架构调整，增加屏幕以及气压计，新增PID在线调整功能；
//  V3.0 开源作者：zhibo_sz&sunsp；日期：2024.06.01
//           新增一键定高起飞，悬停运动控制以及刹车优化，气压遥控屏幕陀螺仪等模块优化，新增无刷电机；
/********************************************************************************************/

//声明：
//      本程序仅对购机用户开源，学习使用，所有权归以上作者所有；
//      未经许可，不得传阅、转载、公开、转卖本代码。


#include "sys.h"

#undef SUCCESS
#define SUCCESS 0
#undef FAILED
#define FAILED  1
#define ZY_31_SLAVE_ADDRESS 0xC0
#define MODULE_REST 0x20
#define MPU6050_GET_OFFSET 0x21
#define MS5611_GET_OFFSET 0x22
#define MPU_READ 0X30
#define ANGLE_READ 0X32

#define HEIGHT_READ 0X33
#define RATE_READ 0X34

/******************************************************************/
//volatile uint32_t SysTick_count; //系统滴答时钟


/***********************************************************************
 * 
 * @param[in] 
 * @param[out] 
 * @return     
 **********************************************************************/


/**************************************************************
 * 滴答时钟ms中断
 * @param[in] 
 * @param[out] 
 * @return     
 ***************************************************************/	
//void SysTick_Handler(void)
//{
//		SysTick_count++; //ms计数
////		LED_display();  	//LED闪烁	
//}
/**************************************************************
// *返回系统当前的运行时间  单位ms
// * @param[in] 
// * @param[out] 
// * @return  ms   
// ***************************************************************/	
//float micros(void) //返回系统当前时间
//{
//	 //SysTick_count 滴答时钟ms计数
//	 //SysTick->VAL 滴答时钟定时器计数器counter 总计数满168000.0f/8.0f为1个ms，并发生滴答时钟ms中断
//	 //168MHZ/1000 = 168000每个ms需要的晶振频率输了
//	 //滴答时钟八分频
//    return SysTick_count + (SysTick->LOAD - SysTick->VAL)/(168000.0f/8.0f);//当前系统时间 单位ms  
//}
/////***********************************************************************
//// * 
//// * @param[in] 
//// * @param[out] 
// * @return     
// **********************************************************************/
//float height;

/********************************END OF FILE*****************************************/


